---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ConicalSurface
source: html/6de1bf03-7f30-32b8-e1d3-fd8c8eed0b89.htm
---
# ConicalSurface Members

Creates a conical surface defined by a local reference frame and a half angle.